cf_billing/DataProcessors/энргМастерПечатиПретензионнойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргМастерПечатиПретензионнойДеятельности</Name>
			<Comment>Формирует документы "Уведомления" "Извещение" "Предупреждения"</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцевЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печатать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сформировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлениеПредыдущее</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргЭтапПретензионноИсковойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлениеДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Извещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печатать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сформировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзвещениеПредыдущее</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргЭтапПретензионноИсковойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзвещениеДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печатать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сформировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредупреждениеПредыдущее</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргЭтапПретензионноИсковойДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредупреждениеДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЭтапыПретензионноИсковойДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЭтапыПретензионноИсковойДеятельности</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСледЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрекращенаДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргМастерПечатиПретензионнойДеятельности/Forms/ФормаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

///////////////////////////
// ЗАПОЛНЕНИЕ УВЕДОМЛЕНИЯ!//
///////////////////////////

&НаСервере
Процедура ЗаполнитьНаСервере(Абоненты = Неопределено)
	
	Если Абоненты = Неопределено Тогда
		Абоненты = Объект.Абонент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_АбонентыДляУдаления
	|ИЗ
	|	Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент В(&Абонент)
	|	И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2
	|	И энргЭтапПретензионноИсковойДеятельности.Дата МЕЖДУ &НачПериода И &КонПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(энргВзаиморасчетыОстатки.СуммаОстаток) КАК Долг,
	|	энргВзаиморасчетыОстатки.Абонент КАК Абонент,
	|	энргВзаиморасчетыОстатки.Услуга КАК Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет КАК ЛС,
	|	энргВзаиморасчетыОстатки.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Абоненты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&КонПериода, Абонент В ИЕРАРХИИ (&Абонент)) КАК энргВзаиморасчетыОстатки
	|ГДЕ
	|	НЕ энргВзаиморасчетыОстатки.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_АбонентыДляУдаления.Абонент
	|				ИЗ
	|					ВТ_АбонентыДляУдаления КАК ВТ_АбонентыДляУдаления)
	|	И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности
	|	И энргВзаиморасчетыОстатки.ПериодНачисления < &ПериодЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыОстатки.Абонент,
	|	энргВзаиморасчетыОстатки.Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет,
	|	энргВзаиморасчетыОстатки.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбонентыКонтактнаяИнформация.Представление КАК Адрес,
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка КАК Абонент
	|ПОМЕСТИТЬ ВТ_Адрес
	|ИЗ
	|	Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|ГДЕ
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Абоненты.Абонент
	|			ИЗ
	|				ВТ_Абоненты КАК ВТ_Абоненты)
	|	И энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Ссылка КАК УведомлениеПредыдущее,
	|	энргЭтапПретензионноИсковойДеятельности.Дата КАК УведомлениеДата,
	|	энргЭтапПретензионноИсковойДеятельности.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_ПредИзвещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(энргЭтапПретензионноИсковойДеятельности.Дата) КАК Дата,
	|		энргЭтапПретензионноИсковойДеятельности.Абонент КАК Абонент
	|	ИЗ
	|		Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|	ГДЕ
	|		энргЭтапПретензионноИсковойДеятельности.Дата < &НачПериода
	|		И энргЭтапПретензионноИсковойДеятельности.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_Абоненты.Абонент
	|				ИЗ
	|					ВТ_Абоненты КАК ВТ_Абоненты)
	|		И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргЭтапПретензионноИсковойДеятельности.Абонент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|		ПО ВложенныйЗапрос.Дата = энргЭтапПретензионноИсковойДеятельности.Дата
	|			И ВложенныйЗапрос.Абонент = энргЭтапПретензионноИсковойДеятельности.Абонент
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Абоненты.ЛС КАК ЛС,
	|	ВТ_Абоненты.Абонент КАК Абонент,
	|	ВТ_Адрес.Адрес КАК Адрес,
	|	ВТ_Абоненты.Долг КАК Долг,
	|	ВТ_Абоненты.Услуга КАК Услуга,
	|	ВТ_ПредИзвещение.УведомлениеПредыдущее КАК УведомлениеПредыдущее,
	|	ВТ_ПредИзвещение.УведомлениеДата КАК УведомлениеДата,
	|	ВТ_Абоненты.Поставщик КАК Поставщик
	|ИЗ
	|	ВТ_Абоненты КАК ВТ_Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Адрес КАК ВТ_Адрес
	|		ПО ВТ_Абоненты.Абонент = ВТ_Адрес.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредИзвещение КАК ВТ_ПредИзвещение
	|		ПО ВТ_Абоненты.Абонент = ВТ_ПредИзвещение.Абонент";
	
	Если ЗначениеЗаполнено(Абоненты) Тогда	
		Запрос.УстановитьПараметр("Абонент", Абоненты);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"энргЭтапПретензионноИсковойДеятельности.Абонент В(&Абонент)","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2","энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Абонент В ИЕРАРХИИ (&Абонент)","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Абоненты) Тогда	
		Запрос.УстановитьПараметр("СуммаЗадолженности", Объект.СуммаЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности","");
	КонецЕсли;
	
	Если Объект.КоличествоМесяцевЗадолженности>0 Тогда
		ПериодЗадолженности = ДобавитьМесяц(Объект.КонПериода, -Объект.КоличествоМесяцевЗадолженности);
		Запрос.УстановитьПараметр("ПериодЗадолженности", ПериодЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргВзаиморасчетыОстатки.ПериодНачисления < &ПериодЗадолженности","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидОперации",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление);
	Запрос.УстановитьПараметр("ВидОперации2",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление);
	Запрос.УстановитьПараметр("КонПериода", Объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериода", Объект.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Объект.Уведомление.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

/////////////////////////
// ЗАПОЛНЕНИЕ ИЗВЕЩЕНИЯ!//
/////////////////////////  

&НаСервере
Процедура ЗаполнитьИзвещениеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент
	|ПОМЕСТИТЬ ВТ_АбонентыДляУдаления
	|ИЗ
	|	Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент = &Абонент
	|	И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2
	|	И энргЭтапПретензионноИсковойДеятельности.Дата МЕЖДУ &НачПериода И &КонПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(энргВзаиморасчетыОстатки.СуммаОстаток) КАК Долг,
	|	энргВзаиморасчетыОстатки.Абонент,
	|	энргВзаиморасчетыОстатки.Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет КАК ЛС,
	|	энргВзаиморасчетыОстатки.Поставщик
	|ПОМЕСТИТЬ ВТ_Абоненты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&КонПериода, Абонент В ИЕРАРХИИ (&Абонент)) КАК энргВзаиморасчетыОстатки
	|ГДЕ
	|	НЕ энргВзаиморасчетыОстатки.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_АбонентыДляУдаления.Абонент
	|				ИЗ
	|					ВТ_АбонентыДляУдаления КАК ВТ_АбонентыДляУдаления)
	|	И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыОстатки.Абонент,
	|	энргВзаиморасчетыОстатки.Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет,
	|	энргВзаиморасчетыОстатки.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбонентыКонтактнаяИнформация.Представление КАК Адрес,
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка КАК Абонент
	|ПОМЕСТИТЬ ВТ_Адрес
	|ИЗ
	|	Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|ГДЕ
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Абоненты.Абонент
	|			ИЗ
	|				ВТ_Абоненты КАК ВТ_Абоненты)
	|	И энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Ссылка КАК УведомлениеПредыдущее,
	|	энргЭтапПретензионноИсковойДеятельности.Дата КАК УведомлениеДата,
	|	энргЭтапПретензионноИсковойДеятельности.Абонент
	|ПОМЕСТИТЬ ВТ_ПредИзвещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(энргЭтапПретензионноИсковойДеятельности.Дата) КАК Дата,
	|		энргЭтапПретензионноИсковойДеятельности.Абонент КАК Абонент
	|	ИЗ
	|		Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|	ГДЕ
	|		энргЭтапПретензионноИсковойДеятельности.Дата < &НачПериода
	|		И энргЭтапПретензионноИсковойДеятельности.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_Абоненты.Абонент
	|				ИЗ
	|					ВТ_Абоненты КАК ВТ_Абоненты)
	|		И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргЭтапПретензионноИсковойДеятельности.Абонент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|		ПО ВложенныйЗапрос.Дата = энргЭтапПретензионноИсковойДеятельности.Дата
	|			И ВложенныйЗапрос.Абонент = энргЭтапПретензионноИсковойДеятельности.Абонент
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Абоненты.ЛС,
	|	ВТ_Абоненты.Абонент,
	|	ВТ_Адрес.Адрес,
	|	ВТ_Абоненты.Долг,
	|	ВТ_Абоненты.Услуга,
	|	ВТ_ПредИзвещение.УведомлениеПредыдущее,
	|	ВТ_ПредИзвещение.УведомлениеДата,
	|	ВТ_Абоненты.Поставщик
	|ИЗ
	|	ВТ_Абоненты КАК ВТ_Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Адрес КАК ВТ_Адрес
	|		ПО ВТ_Абоненты.Абонент = ВТ_Адрес.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредИзвещение КАК ВТ_ПредИзвещение
	|		ПО ВТ_Абоненты.Абонент = ВТ_ПредИзвещение.Абонент";
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда	
		Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"энргЭтапПретензионноИсковойДеятельности.Абонент = &Абонент","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2","энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Абонент В ИЕРАРХИИ (&Абонент)","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда	
		Запрос.УстановитьПараметр("СуммаЗадолженности", Объект.СуммаЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидОперации",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Извещение);
	Запрос.УстановитьПараметр("ВидОперации2",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Извещение);
	Запрос.УстановитьПараметр("КонПериода", Объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериода", Объект.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Объект.Извещение.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзвещение(Команда)
	ЗаполнитьИзвещениеНаСервере();
КонецПроцедуры

//////////////////////////////
// ЗАПОЛНЕНИЕ ПРЕДУПРЕЖДЕНИЯ!//
//////////////////////////////

&НаСервере
Процедура ЗаполнитьПредупреждениеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент
	|ПОМЕСТИТЬ ВТ_АбонентыДляУдаления
	|ИЗ
	|	Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.Абонент = &Абонент
	|	И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2
	|	И энргЭтапПретензионноИсковойДеятельности.Дата МЕЖДУ &НачПериода И &КонПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(энргВзаиморасчетыОстатки.СуммаОстаток) КАК Долг,
	|	энргВзаиморасчетыОстатки.Абонент,
	|	энргВзаиморасчетыОстатки.Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет КАК ЛС
	|ПОМЕСТИТЬ ВТ_Абоненты
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(&КонПериода, Абонент В ИЕРАРХИИ (&Абонент)) КАК энргВзаиморасчетыОстатки
	|ГДЕ
	|	НЕ энргВзаиморасчетыОстатки.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_АбонентыДляУдаления.Абонент
	|				ИЗ
	|					ВТ_АбонентыДляУдаления КАК ВТ_АбонентыДляУдаления)
	|	И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыОстатки.Абонент,
	|	энргВзаиморасчетыОстатки.Услуга,
	|	энргВзаиморасчетыОстатки.Абонент.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргАбонентыКонтактнаяИнформация.Представление КАК Адрес,
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка КАК Абонент
	|ПОМЕСТИТЬ ВТ_Адрес
	|ИЗ
	|	Справочник.энргАбоненты.КонтактнаяИнформация КАК энргАбонентыКонтактнаяИнформация
	|ГДЕ
	|	энргАбонентыКонтактнаяИнформация.Ссылка.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Абоненты.Абонент
	|			ИЗ
	|				ВТ_Абоненты КАК ВТ_Абоненты)
	|	И энргАбонентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЭтапПретензионноИсковойДеятельности.Ссылка КАК УведомлениеПредыдущее,
	|	энргЭтапПретензионноИсковойДеятельности.Дата КАК УведомлениеДата,
	|	энргЭтапПретензионноИсковойДеятельности.Абонент
	|ПОМЕСТИТЬ ВТ_ПредИзвещение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		МАКСИМУМ(энргЭтапПретензионноИсковойДеятельности.Дата) КАК Дата,
	|		энргЭтапПретензионноИсковойДеятельности.Абонент КАК Абонент
	|	ИЗ
	|		Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|	ГДЕ
	|		энргЭтапПретензионноИсковойДеятельности.Дата < &НачПериода
	|		И энргЭтапПретензионноИсковойДеятельности.Абонент В
	|				(ВЫБРАТЬ
	|					ВТ_Абоненты.Абонент
	|				ИЗ
	|					ВТ_Абоненты КАК ВТ_Абоненты)
	|		И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		энргЭтапПретензионноИсковойДеятельности.Абонент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргЭтапПретензионноИсковойДеятельности КАК энргЭтапПретензионноИсковойДеятельности
	|		ПО ВложенныйЗапрос.Дата = энргЭтапПретензионноИсковойДеятельности.Дата
	|			И ВложенныйЗапрос.Абонент = энргЭтапПретензионноИсковойДеятельности.Абонент
	|ГДЕ
	|	энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Абоненты.ЛС,
	|	ВТ_Абоненты.Абонент,
	|	ВТ_Адрес.Адрес,
	|	ВТ_Абоненты.Долг,
	|	ВТ_Абоненты.Услуга,
	|	ВТ_ПредИзвещение.УведомлениеПредыдущее,
	|	ВТ_ПредИзвещение.УведомлениеДата
	|ИЗ
	|	ВТ_Абоненты КАК ВТ_Абоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Адрес КАК ВТ_Адрес
	|		ПО ВТ_Абоненты.Абонент = ВТ_Адрес.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредИзвещение КАК ВТ_ПредИзвещение
	|		ПО ВТ_Абоненты.Абонент = ВТ_ПредИзвещение.Абонент";
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда	
		Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"энргЭтапПретензионноИсковойДеятельности.Абонент = &Абонент","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2","энргЭтапПретензионноИсковойДеятельности.ЭтапПИД = &ВидОперации2");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Абонент В ИЕРАРХИИ (&Абонент)","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Абонент) Тогда	
		Запрос.УстановитьПараметр("СуммаЗадолженности", Объект.СуммаЗадолженности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И энргВзаиморасчетыОстатки.СуммаОстаток <= &СуммаЗадолженности","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидОперации",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Предупреждение);
	Запрос.УстановитьПараметр("ВидОперации2",Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Предупреждение);
	Запрос.УстановитьПараметр("КонПериода", Объект.КонПериода);
	Запрос.УстановитьПараметр("НачПериода", Объект.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	Объект.Предупреждение.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредупреждение(Команда)
	ЗаполнитьПредупреждениеНаСервере();
КонецПроцедуры

//////////////////////
// УСТАНОВКА ФЛАЖКОВ!//
//////////////////////

&НаКлиенте
Процедура СформироватьПроставить(Команда)
	Для Каждого Стр Из Объект.Уведомление цикл
		Стр.Сформировать = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУдалитьВсе(Команда)
	Для Каждого Стр Из Объект.Уведомление цикл
		Стр.Сформировать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПроставитьВсе(Команда)
	Для Каждого Стр Из Объект.Уведомление цикл
		Стр.Печатать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУдалитьВсе(Команда)
	Для Каждого Стр Из Объект.Уведомление цикл
		Стр.Печатать = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПроставитьВсеИзв(Команда)
	Для Каждого Стр Из Объект.Извещение цикл
		Стр.Печатать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПроставитьВсеПред(Команда)
	Для Каждого Стр Из Объект.Предупреждение цикл
		Стр.Печатать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУдалитьВсеИзв(Команда)
	Для Каждого Стр Из Объект.Извещение цикл
		Стр.Печатать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУдалитьВсеПред(Команда)
	Для Каждого Стр Из Объект.Предупреждение цикл
		Стр.Печатать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПроставитьИзв(Команда)
	Для Каждого Стр Из Объект.Извещение цикл
		Стр.Сформировать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПроставитьПред(Команда)
	Для Каждого Стр Из Объект.Предупреждение цикл
		Стр.Сформировать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУдалитьВсеИзв(Команда)
	Для Каждого Стр Из Объект.Извещение цикл
		Стр.Сформировать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУдалитьВсеПред(Команда)
	Для Каждого Стр Из Объект.Предупреждение цикл
		Стр.Сформировать = Ложь;
	КонецЦикла;
КонецПроцедуры

/////////////////////////////////////////
// ПЕЧАТЬ ОТЧЕТОВ И СОЗДАНИЕ ДОКУМЕНТОВ!//
/////////////////////////////////////////

/////////////////
// Уведомление!///
/////////////////

&НаСервере
Функция СформироватьДокументыНаСервере(ТабДок)
	НачатьТранзакцию();
	
	Для каждого Стр из объект.Уведомление Цикл
		
		Если Стр.Сформировать Тогда
			Док = Документы.энргЭтапПретензионноИсковойДеятельности.СоздатьДокумент(); 
			Док.Дата				= ТекущаяДата();
			Док.Абонент 			= Стр.Абонент;
			Док.АдресОбъекта		= Стр.Адрес;
			Док.Поставщик 			= Стр.Поставщик;
			Док.ЛицевойСчет 		= Стр.ЛС;
			Док.СуммаЗадолженности 	= Стр.Долг;
			Док.ЭтапПИД 			= Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление;		
			Док.Записать(РежимЗаписиДокумента.Проведение);
			
			Если Стр.Печатать Тогда
				ТабДок = Док.ЗаполнитьУведомление(ТабДок); 				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.КоличествоЭкземпляров = 2;
	ТабДок.ОтображатьСетку = Ложь;
	
	СформироватьДокументыНаСервере(ТабДок).Показать();
КонецПроцедуры

///////////////
// Извещение!///
///////////////

&НаСервере
Функция  СформироватьДокументыИзвНаСервере(ТабДок)
	НачатьТранзакцию();
	
	Для каждого Стр из объект.Уведомление Цикл
		// Проверяет был ли создан документ Уведомление для данного абонента.
		// Если нет - Документ Извещение не сформируется!
		// Если да  - Документ Извещение сформируется!
		ДокОснование = Проверка(Стр.Абонент,Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Уведомление);
		
		Если Стр.Сформировать Тогда
			
			Если  ДокОснование <> Неопределено Тогда
				Док = Документы.энргЭтапПретензионноИсковойДеятельности.СоздатьДокумент();
				Док.Дата									= ТекущаяДата();
				Док.Абонент 								= Стр.Абонент;
				Док.АдресОбъекта							= Стр.Адрес;
				Док.Поставщик 								= Стр.Поставщик;
				Док.ЛицевойСчет 							= Стр.ЛС;
				Док.СуммаЗадолженности 						= Стр.Долг;
				Док.ЭтапПИД 								= Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Извещение;				
				Док.Основание								= ДокОснование;				
				Док.Записать(РежимЗаписиДокумента.Проведение);
				Если Стр.Печатать Тогда
					ТабДок = Док.ЗаполнитьИзвещение(ТабДок);
				КонецЕсли; 				
				
			иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для абонента: " + Стр.Абонент + " не найден документ ""Уведомление"""); 				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура СформироватьДокументыИзв(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.КоличествоЭкземпляров = 2;
	ТабДок.ОтображатьСетку = Ложь;
	
	СформироватьДокументыИзвНаСервере(ТабДок).Показать();
КонецПроцедуры

///////////////////
// Предупреждение!//
///////////////////

&НаСервере
Функция  СформироватьДокументыПредНаСервере(ТабДок)
	НачатьТранзакцию();
	
	Для каждого Стр из объект.Уведомление Цикл
		// Проверяет был ли создан документ Извещение для данного абонента.
		// Если нет - Документ Предупреждение не сформируется!
		// Если да  - Документ Предупреждение сформируется!
		ДокОснование = Проверка(Стр.Абонент,Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Извещение);
		
		Если Стр.Сформировать Тогда
			
			Если ДокОснование <> Неопределено Тогда
				
				Док = Документы.энргЭтапПретензионноИсковойДеятельности.СоздатьДокумент(); 
				Док.Дата				= ТекущаяДата();
				Док.Абонент 			= Стр.Абонент;
				Док.АдресОбъекта		= Стр.Адрес;
				Док.Поставщик 			= Стр.Поставщик;
				Док.ЛицевойСчет 		= Стр.ЛС;
				Док.СуммаЗадолженности 	= Стр.Долг;
				Док.ЭтапПИД 			= Справочники.энргВидыОперацийПИД.ЭтапПретензионноИсковойДеятельности_Предупреждение; 				
				Док.Основание			= ДокОснование;
				
				Док.Записать(РежимЗаписиДокумента.Проведение);	
				
				Если Стр.Печатать Тогда
					ТабДок = Док.ЗаполнитьПредупреждение(ТабДок);
				КонецЕсли;
								
			иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для абонента: " + Стр.Абонент + " не найден документ ""Извещение""");				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура СформироватьДокументыПред(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.КоличествоЭкземпляров = 2;
	ТабДок.ОтображатьСетку = Ложь;
	
	СформироватьДокументыПредНаСервере(ТабДок).Показать();
КонецПроцедуры


&НаСервере
Функция Проверка(Абонент,Этап)
	
	Док = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргЭтапыПретензионноИсковойДеятельности.Регистратор КАК Документ
	|ИЗ
	|	РегистрСведений.энргЭтапыПретензионноИсковойДеятельности КАК энргЭтапыПретензионноИсковойДеятельности
	|ГДЕ
	|	энргЭтапыПретензионноИсковойДеятельности.Абонент = &Абонент
	|	И энргЭтапыПретензионноИсковойДеятельности.Регистратор.Дата МЕЖДУ &НП И &КП
	|	И энргЭтапыПретензионноИсковойДеятельности.Этап = &Этап";
	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Запрос.УстановитьПараметр("НП", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КП", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Этап", Этап);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Док = Выборка.Документ;
	КонецЕсли;
	
	Возврат Док;  	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Абоненты = Неопределено;
	Если Параметры.Свойство("Абоненты", Абоненты) Тогда
		ЗаполнитьНаСервере(Абоненты);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
